
&НаСервереБезКонтекста
Процедура УстановкаНастроекОбменаСертификатамиПоУмолчаниюНаСервере()
   ДвоичныеДанные = Обработки.УстановкаНачальныхНастроекСинхронизацииСертификатов.ПолучитьМакет("МакетНастроекПоУмолчанию");
   ИмявВременногоФайла = ПолучитьИмяВременногоФайла("xml");
   ДвоичныеДанные.Записать(ИмявВременногоФайла);
   ВыгрузкаЗагрузка = Обработки.ВыгрузкаЗагрузкаДанныхXML.Создать();
   ВыгрузкаЗагрузка.ВыполнитьЗагрузку(ИмявВременногоФайла);
КонецПроцедуры

&НаКлиенте
Процедура УстановкаНастроекОбменаСертификатамиПоУмолчанию(Команда)
	УстановкаНастроекОбменаСертификатамиПоУмолчаниюНаСервере(); 
	ТочкаОбменаСертификатами = "CertificatesTest"; 
	ОбщегоНазначенияКлиент.СообщитьПользователю("Настройки загружены");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТочкуОбменаИПривязатьОчередь(Команда)
	Отказ = Ложь;
	TrierRabbitMQОбщийМодульВызовСервера.СозданиеТочкиОбменаНаСервере(Отказ,ТочкаОбменаСертификатами,Строка(ГруппаДоступаДляТекущейБазы));
	УстановкаКонстантыПоСертифкатамНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановкаКонстантыПоСертифкатамНаСервере()
	Константы.ТочкаОбменаСертификатами.Установить(ТочкаОбменаСертификатами);	
КонецПроцедуры
	