#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеПолейПередУказаниемСерий(ВсеЗаполнено, Форма, ПараметрыУказанияСерий, ТекущиеДанные, ВыдаватьСообщения) Экспорт
	
	//++ Локализация
		
	ЭтоМаркировкаТоваровГИСМ = ПараметрыУказанияСерий.СкладскиеОперации.Найти(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.МаркировкаПродукцииДляГИСМ")) <> Неопределено;
	ЭтоОперацияИдентификации = ПараметрыУказанияСерий.ОперацияДокумента = ПредопределенноеЗначение("Перечисление.ОперацииМаркировкиГИСМ.ИдентификацияРанееМаркированнойНаПроизводствеПродукции")
		ИЛИ ПараметрыУказанияСерий.ОперацияДокумента = ПредопределенноеЗначение("Перечисление.ОперацииМаркировкиГИСМ.ИдентификацияРанееМаркированныхПриИмпортеТоваров");
	
	Если ЭтоМаркировкаТоваровГИСМ
		И Не ЭтоОперацияИдентификации
		И (Не ЗначениеЗаполнено(ТекущиеДанные.НоменклатураКиЗ)
		Или ТекущиеДанные.ХарактеристикиКиЗИспользуются
		И Не ЗначениеЗаполнено(ТекущиеДанные.ХарактеристикаКиЗ)) Тогда
		Если ВыдаватьСообщения Тогда
			
			ТекстСообщения = НСтр("ru = 'Перед указанием серий нужно выбрать КиЗ.';
									|en = 'Select CIM before specifying the series.'");
			ПоказатьПредупреждение(,ТекстСообщения);
		КонецЕсли;
		ВсеЗаполнено = Ложь;
	ИначеЕсли ЭтоМаркировкаТоваровГИСМ
		И Не ЭтоОперацияИдентификации
		И Не ЗначениеЗаполнено(ТекущиеДанные.GTIN) Тогда
		Если ВыдаватьСообщения Тогда
			
			ТекстСообщения = НСтр("ru = 'Перед указанием серий нужно указать GTIN.';
									|en = 'Specify GTIN before specifying the series.'");
			ПоказатьПредупреждение(,ТекстСообщения);
		КонецЕсли;
		ВсеЗаполнено = Ложь;
	КонецЕсли;
	
	//-- Локализация
	
	Возврат;
	
КонецПроцедуры

Процедура ГиперссылкаПерейти(Форма, ПараметрыПереходаПоГиперссылке, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	Если ПараметрыПереходаПоГиперссылке.ИмяЭлемента = "ОткрытьФормуНастройкиВидовУпаковокПоGTINИСМП" Тогда
		
		СтандартнаяОбработка = Ложь;
		Объект               = Форма.Объект;
		
		ИнтеграцияИСМПКлиент.ОткрытьФормуНастройкиВидовУпаковокПоНоменклатуре(Форма, Объект.Ссылка);
	
	КонецЕсли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура ПараметрыПереходаПоГиперссылке(Форма, ПараметрыПереходаПоГиперссылке, ИмяЭлемента, Гиперссылка) Экспорт
	
	//++ Локализация
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура РазрешитьРедактированиеРеквизитовОбъектаЗавершение(Форма, Результат, ДополнительныеПараметры) Экспорт
	
	//++ Локализация
	Если Результат.Найти("ЕдиницаИзмерения") <> Неопределено Тогда
		ПользовательРазрешилРедактирование = ИнтеграцияИСУТКлиент.ПользовательРазрешилРедактированиеРеквизита(Форма);
		ИнтеграцияИСМПУТКлиентСервер.НастройкаЭлементовВидаУпаковки(Форма, ПользовательРазрешилРедактирование, Ложь);
    КонецЕсли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

#КонецОбласти