
&НаСервереБезКонтекста
Процедура ПроверитьПодключениеНаСервере(Отказ)
	TrierRabbitMQОбщийМодульВызовСервера.ПроверкаПодключенияСервер(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)  
	Отказ = Ложь;
	ПроверитьПодключениеНаСервере(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИдентификаторИБ(Команда)
	СтруктураАдреса = TrierRabbitMQОбщийМодульВызовСервера.ПолучитьСтруктуруАдресаИБ();    
	TrierRabbitMQОбщийМодульВызовСервера.УстановитьЗначениеКонстанты("TrierRabbitMQИдентификаторБазы",СтруктураАдреса.ИмяБазы);
	TrierRabbitMQОбщийМодульВызовСервера.УстановитьЗначениеКонстанты("TrierRabbitMQВиртуальныйХост","test");
	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОчередь(Команда)
	Отказ = Ложь;
	TrierRabbitMQОбщийМодульВызовСервера.СозданиеОчередиНаСервере(Отказ);
КонецПроцедуры  
